src/api-guides/travel/hotelservice2/sample-requests/general-walkthrough/avail-rq.xml

<?xml version="1.0" encoding="UTF-8"?>

<!-- HTTP-headers start 

POST HTTP/1.1
accept: application/xml
accept-charset: utf-8
authorization: Basic xxxxxxxxxxxxxxxx
concur-correlationid: 25506b4f5539549f05aaefd02b4a7460
concur-loginid:  xxxxxxxxxxxx
concur-traveleruuid:  xxxxxxxxxxxx
content-type: application/xml; charset="utf-8"
soapaction: availability

    HTTP-headers end -->

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Header xmlns="http://schemas.xmlsoap.org/soap/envelope/">
        <authentication xmlns="http://www.concur.com/webservice/auth">
            <userid>xxxxxxxxxxxx</userid>
            <password>xxxxxxxxxxx</password>
        </authentication>
    </Header>
    <Body xmlns="http://schemas.xmlsoap.org/soap/envelope/">
        <OTA_HotelAvailRQ xmlns="http://www.opentravel.org/OTA/2003/05" EchoToken="18899B6B-9655-4AAF-8934-ACD252C054A2" Version="5" PrimaryLangID="en" AltLangID="en">
            <POS>
                <Source ISOCurrency="USD">
                    <RequestorID Type="1" ID="requestor_id"></RequestorID>
                </Source>
            </POS>
            <AvailRequestSegments>
                <AvailRequestSegment>
                    <HotelSearchCriteria>
                        <Criterion>
                            <HotelRef ChainCode="PF" HotelCode="HP070213"></HotelRef>
                        </Criterion>
                        <Criterion>
                            <HotelRef ChainCode="ZZ" HotelCode="HH910312"></HotelRef>
                        </Criterion>
                        <Criterion>
                            <HotelRef ChainCode="TL" HotelCode="HT030025"></HotelRef>
                        </Criterion>
                        <Criterion>
                            <HotelRef ChainCode="CU" HotelCode="HH871486"></HotelRef>
                        </Criterion>
                        <Criterion>
                            <HotelRef ChainCode="LQ" HotelCode="HL031350"></HotelRef>
                        </Criterion>
                        <Criterion>
                            <HotelRef ChainCode="NC" HotelCode="HE030953"></HotelRef>
                        </Criterion>
                        <Criterion>
                            <HotelRef ChainCode="WK" HotelCode="HW030255"></HotelRef>
                        </Criterion>
                        <Criterion>
                            <HotelRef ChainCode="BW" HotelCode="HB030284"></HotelRef>
                        </Criterion>
                        <Criterion>
                            <HotelRef ChainCode="WV" HotelCode="HP030567"></HotelRef>
                        </Criterion>
                        <Criterion>
                            <HotelRef ChainCode="QQ" HotelCode="HH784890"></HotelRef>
                        </Criterion>
                    </HotelSearchCriteria>
                    <StayDateRange Start="2021-09-28" End="2021-10-01"></StayDateRange>
                    <RoomStayCandidates>
                        <RoomStayCandidate>
                            <GuestCounts>
                                <GuestCount AgeQualifyingCode="10" Count="1"></GuestCount>
                            </GuestCounts>
                        </RoomStayCandidate>
                    </RoomStayCandidates>
                    <TPA_Extensions>
                        <SearchSessionToken>ed46904d-2d32-4aa3-b2da-8ec15ecce404</SearchSessionToken>
                    </TPA_Extensions>
                </AvailRequestSegment>
            </AvailRequestSegments>
        </OTA_HotelAvailRQ>
    </Body>
</Envelope>